#include <iostream>


/*
 *  C 语言的特点
 *  （1）作为一种面向过程的结构化语言，易于调试和维护。
 *          面向过程的语言也称为结构化程序设计语言，是高级语言的一种。
 *          在面向过程程序设计中，问题被看作一系列需要完成的任务，函数则用于完成这些任务，解决问题的焦点集中于函数。
 *          其概念最早由E．W．Dijikstra在1965年提出，是软件发展的一个重要里程碑。
 *          它的主要观点是采用自顶向下、逐步求精的程序设计方法，使用三种基本控制结构构造程序，即任何程序都可由顺序、选择、循环三种基本控制结构构造
 *
 *  （2）效率高，可移植性强
 *
 *  C++语言特点
 *  （1）兼容C语言面向过程的特点，是一门面向对象的程序设计语言
 *          面向对象是相对于面向过程来讲的，面向对象方法，是一种对现实世界理解和抽象的方法，把相关的数据和方法组织为一个整体来看待，
 *          从更高的层次来进行系统建模，更贴近事物的自然运行模式
 *
 *          面向对象程序设计的核心思想是 数据抽象 继承 动态绑定。
 *          数据抽象：事物或者问题，用数据和方法抽象表述。封装实现类的接口和实现的分离。
 *          继承：定义相似的类型并对其相似关系建模
 *          动态绑定：运行时绑定，在一定程度上忽略相似类型的区别，以统一的方式使用不同相似类型的实例化对象
 *              使用基类的引用或者指针，调用一个虚函数时将发生动态绑定
 *
 *
 *
 *  （2）以模板为特征的泛型编程
 *
 * */



int main() {
    std::cout << "Hello, World!" << std::endl;
    return 0;
}
